Revit 2026 API

# NurbsSurfaceDataCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static NurbsSurfaceData Create(
	int degreeU,
	int degreeV,
	IList<double> knotsU,
	IList<double> knotsV,
	IList<XYZ> controlPoints,
	IList<double> weights,
	bool bReverseOrientation
)
```
```vb
Public Shared Function Create (
	degreeU As Integer,
	degreeV As Integer,
	knotsU As IList(Of Double),
	knotsV As IList(Of Double),
	controlPoints As IList(Of XYZ),
	weights As IList(Of Double),
	bReverseOrientation As Boolean
) As NurbsSurfaceData
```
```cpp
public:
static NurbsSurfaceData^ Create(
	int degreeU,
	int degreeV,
	IList<double>^ knotsU,
	IList<double>^ knotsV,
	IList<XYZ^>^ controlPoints,
	IList<double>^ weights,
	bool bReverseOrientation
)
```
```fsharp
static member Create :
        degreeU : int *
        degreeV : int *
        knotsU : IList<float> *
        knotsV : IList<float> *
        controlPoints : IList<XYZ> *
        weights : IList<float> *
        bReverseOrientation : bool -> NurbsSurfaceData
```

#### Parameters

degreeU Int32

degreeV Int32

knotsU IListDouble

knotsV IListDouble

controlPoints IListXYZ

weights IListDouble

bReverseOrientation Boolean

#### Return Value

NurbsSurfaceData

#### Reference

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace